zup/ЗУП_бюджет/src/Documents/ДопускКНаркотическимВеществам/ДопускКНаркотическимВеществам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДопускКНаркотическимВеществам</name>
  <basedOn>Document.ОтветФСКН</basedOn>
  <registerRecords>InformationRegister.ДопускиСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОтветФСКН</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СправкаНаркологическогоДиспансера</name>
      <type>
        <types>CatalogRef.СправкиФизическихЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>СправкаПсихоневрологическогоДиспансера</name>
      <type>
        <types>CatalogRef.СправкиФизическихЛиц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zup/ЗУП_бюджет/src/InformationRegisters/ДопускиСотрудников/ДопускиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДопускиСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусДопуска</name>
    <type>
      <types>EnumRef.СтатусыДопусков</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДопуска</name>
    <type>
      <types>CatalogRef.ВидыДопусков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/InformationRegisters/СостоянияЗапросовВФСКН/СостоянияЗапросовВФСКН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗапросовВФСКН</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/Enums/СтатусыДопусков/СтатусыДопусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДопусков</name>
  <enumValues>
    <name>Недействителен</name>
  </enumValues>
  <enumValues>
    <name>Действителен</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСогласования</name>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Catalogs/ВидыДопусков/ВидыДопусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДопусков</name>
  <predefined>
    <items>
      <name>ДопускКНаркотическимВеществам</name>
      <description>Допуск к работе с наркотическими веществами</description>
    </items>
  </predefined>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

zup/ЗУП_бюджет/src/Catalogs/ВидыСправок/ВидыСправок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыСправок</name>
  <predefined>
    <items>
      <name>НаличиеОтсутствиеСудимости</name>
      <description>Cправка о наличии (отсутствии) судимости</description>
    </items>
    <items>
      <name>НаркологическийДиспансер</name>
      <description>Наркологический диспансер</description>
    </items>
    <items>
      <name>ПсихоневрологическийДиспансер</name>
      <description>Психоневрологический диспансер</description>
    </items>
  </predefined>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

zup/ЗУП_бюджет/src/Catalogs/СправкиФизическихЛиц/СправкиФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СправкиФизическихЛиц</name>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>ВидСправки</name>
    <type>
      <types>CatalogRef.ВидыСправок</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

zup/ЗУП_бюджет/src/Documents/ДопускКНаркотическимВеществам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СотрудникиДокумента = Сотрудники.ВыгрузитьКолонку("Сотрудник");
	ПроверитьСотрудников(Отказ);
	
	Если НЕ Отказ Тогда

	Для Каждого Строка Из Сотрудники Цикл
		
		Движение = Движения.ДопускиСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ВидДопуска = Справочники.ВидыДопусков.ДопускКНаркотическимВеществам;
		Движение.СтатусДопуска = Перечисления.СтатусыДопусков.Действителен;
		
	КонецЦикла;
	
	Движения.ДопускиСотрудников.Записывать = Истина;
	
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ЭтотОбъект.Метаданные().Реквизиты.ДокументОснование.Тип.СодержитТип(ТипЗнч(ДанныеЗаполнения)) Тогда
		ЗаполнитьПоОснованию(ДанныеЗаполнения);
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров для ограничения регистрации объекта при обмене
// Вызывается ПередЗаписью объекта.
//
// Возвращаемое значение:
//	ОграниченияРегистрации - Структура - Описание см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации.
//
Функция ОграниченияРегистрации() Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый Структура("Сотрудники", "Сотрудник"));
	
	Возврат ОбменДаннымиЗарплатаКадры.ОграниченияРегистрацииПоОрганизацииИСотрудникам(ЭтотОбъект, Организация, МассивПараметров, Дата);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоОснованию(Основание)
	
	ДокументОснование = Основание;
	Организация	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Организация");
	
	ПолучитьСообщенияПользователю(Истина);
	
	Если МожноЗаполнитьПоОтветуФСКН() Тогда
		ЗаполнитьПоОтветуФСКН();
	КонецЕсли;	
	
	Сообщения = ПолучитьСообщенияПользователю(Истина); 
	Если Сообщения.Количество() > 0 Тогда 
		СообщениеОбОшибке = "";
		Для Каждого Сообщение Из Сообщения Цикл
			СообщениеОбОшибке = СообщениеОбОшибке + Сообщение.Текст + Символы.ПС
		КонецЦикла;	
		ВызватьИсключение СообщениеОбОшибке;
	КонецЕсли;	
	
КонецПроцедуры

Функция МожноЗаполнитьПоОтветуФСКН() Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат Ложь
	КонецЕсли;	
	
	МожноЗаполнитьПоОтветуФСКН = Истина;
	
	ДанныеОтветаФСКН = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Проведен, Организация");
	
	Если ДанныеОтветаФСКН.Организация <> Организация Тогда
		МожноЗаполнитьПоОтветуФСКН = Ложь;
		СообщениеОбОшибке = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 относится к другой организации (%2)'"), 
			ДокументОснование, 
			ДанныеОтветаФСКН.Организация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, ЭтотОбъект, "ДокументОснование");
	КонецЕсли;	
	
	Если НЕ ДанныеОтветаФСКН.Проведен Тогда
		МожноЗаполнитьПоОтветуФСКН = Ложь;
		СообщениеОбОшибке = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Ответ ФСКН не проведен'"), 
			ДокументОснование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, ЭтотОбъект, "ДокументОснование");
	КонецЕсли;	
	
	Возврат МожноЗаполнитьПоОтветуФСКН
	
КонецФункции

Процедура ЗаполнитьПоОтветуФСКН() Экспорт
	
	// Очищаем текущие строки документа.
	Сотрудники.Очистить();
	
	// Получаем сотрудников ответа ФСКН, по которым ответ положительный.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияЗапросовВФСКН.Сотрудник,
	|	СостоянияЗапросовВФСКН.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо 
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	РегистрСведений.СостоянияЗапросовВФСКН КАК СостоянияЗапросовВФСКН
	|ГДЕ
	|	СостоянияЗапросовВФСКН.Регистратор = &ДокументОснование
	|	И СостоянияЗапросовВФСКН.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Согласовано)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Сотрудник
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента";

	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		СообщениеОбОшибке = НСтр("ru='В документе нет сотрудника с положительным ответом ФСКН'"); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, ЭтотОбъект, "ДокументОснование");
		Возврат
	КонецЕсли;
	
	// Параметры для получения требуемых в документе справок.
	ВидыСправок=Новый Массив;
	ВидыСправок.Добавить(Справочники.ВидыСправок.НаркологическийДиспансер);
	ВидыСправок.Добавить(Справочники.ВидыСправок.ПсихоневрологическийДиспансер);
	ДатаЗначения=?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	
	// Создание временной таблицы справок физических лиц.
	Справочники.СправкиФизическихЛиц.СоздатьВТСправкиФизическихЛицНаДату(
		Запрос.МенеджерВременныхТаблиц, ВидыСправок , ДатаЗначения);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Сотрудник,
	|	СправкиПсихоневрологическийДиспансера.Ссылка КАК СправкаПсихоневрологическогоДиспансера,
	|	СправкиНаркологическийДиспансер.Ссылка КАК СправкаНаркологическогоДиспансера
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСправкиФизическихЛиц КАК СправкиПсихоневрологическийДиспансера
	|		ПО ДанныеДокумента.Сотрудник.ФизическоеЛицо = СправкиПсихоневрологическийДиспансера.Владелец
	|			И (ЗНАЧЕНИЕ(Справочник.ВидыСправок.ПсихоневрологическийДиспансер) = СправкиПсихоневрологическийДиспансера.ВидСправки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСправкиФизическихЛиц КАК СправкиНаркологическийДиспансер
	|		ПО ДанныеДокумента.Сотрудник.ФизическоеЛицо = СправкиНаркологическийДиспансер.Владелец
	|			И (ЗНАЧЕНИЕ(Справочник.ВидыСправок.НаркологическийДиспансер) = СправкиНаркологическийДиспансер.ВидСправки)";
	
	// Заполняем по сотрудникам 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		// В случае ошибки пользователя, при создании двух одинаковых,по виду справки и по началу ее действия, справок,
		// строки сотрудника могут задваиваться.
		Если Сотрудники.Найти(Выборка.Сотрудник,"Сотрудник") = Неопределено Тогда
			СтрокаТЧ = Сотрудники.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПроверитьСотрудников(Отказ) 
	
	Ошибки = Неопределено;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Допуск.Сотрудник.Представление КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА СотрудникиДокументаОснования.Сотрудник ЕСТЬ NULL 
		|			ТОГДА 1
		|		КОГДА СостоянияЗапросовВФСКНСрезПоследних.Состояние = ЗНАЧЕНИЕ(перечисление.СостоянияСогласования.Отклонено)
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ИндексОшибки,
		|	Допуск.НомерСтроки
		|ПОМЕСТИТЬ ВТСотрудникиСИндексомОшибки
		|ИЗ
		|	Документ.ДопускКНаркотическимВеществам.Сотрудники КАК Допуск
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗапросовВФСКН.СрезПоследних(, Регистратор = &ДокументОснование) КАК СотрудникиДокументаОснования
		|		ПО Допуск.Сотрудник = СотрудникиДокументаОснования.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗапросовВФСКН.СрезПоследних(&Дата, ) КАК СостоянияЗапросовВФСКНСрезПоследних
		|		ПО Допуск.Сотрудник = СостоянияЗапросовВФСКНСрезПоследних.Сотрудник
		|ГДЕ
		|	Допуск.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиСИндексомОшибки.Сотрудник,
		|	СотрудникиСИндексомОшибки.ИндексОшибки,
		|	СотрудникиСИндексомОшибки.НомерСтроки
		|ИЗ
		|	ВТСотрудникиСИндексомОшибки КАК СотрудникиСИндексомОшибки
		|ГДЕ
		|	СотрудникиСИндексомОшибки.ИндексОшибки <> 0"; 

		
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Дата", Дата);

		РезультатЗапроса=Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ИндексОшибки = 1 Тогда
					
					СообщениеОбОшибке = 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru='В ответе ФСКН нет сотрудника %1'"), 
							Выборка.Сотрудник);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, ЭтотОбъект, "ДокументОснование", , Отказ);
					
				ИначеЕсли Выборка.ИндексОшибки = 2 Тогда
					
					СообщениеОбОшибке = 
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='%1 имеет отрицательный ответ органа ФСКН в документе основания'"), 
						Выборка.Сотрудник);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, , 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Сотрудники[%1].%2", Выборка.НомерСтроки-1, "Сотрудник"), , Отказ);
 																						 			
				КонецЕсли;
							
			КонецЦикла;

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
